export const data = {
    about: {
        notion: "https://www.notion.so/jonggeun-frontend-developer/React-FE-eef0274b847147e1bce608264b348aea?pvs=4",
        github: "https://github.com/dldvk9999",
        blog: "https://blog.naver.com/dldvk9999",
        email: "dldvk9999@naver.com",
        tel: "010-7184-6533",
        isnew: 1,
        lastgraduate: "수원대학교 정보보호학과 졸업",
        birth: "1998-01-05",
        name: "박종근",
        certification: "정보처리기사",
        deployment: "Vercel,Heroku,Github",
        versioncontrol: "Git,Github,Gitlab",
        communication: "Slack,Jira,Microsoft Teams,Zoom,Figma,Confluence",
        platform: "PC Software,Web.Frontend,Web.Backend,Chrome Extension,Android App,IOS App",
        backend: "Nodejs,Django,Mysql,MariaDB,PostgreSQL",
        frontend: "React,Angular,Vue,JQuery,Sass,Nextjs,Gatsby,Bootstrap,Recoil,Redux,Redux-Saga,PWA",
        language: "Python,Javascript,Typescript,HTML,CSS,Java,Swift,C,C++",
    },
    experience: [
        {
            id: 1,
            name: "가비아CNS",
            start: "2023-04-10",
            end: "진행중",
            position: ["통합관리솔루션개발팀 유닛원", "마켓통합유닛 유닛원", "클릭엔유닛 유닛원"],
            job: [
                {
                    title: "쇼핑몰 통합관리솔루션(하이셀링) 유지보수 및 마켓 연동",
                    contents: "React를 이용한 최적화 및 약 63% 성능 향상 및 카카오톡스토어 마켓 API와 하이셀링 연동",
                    stack: "kubernates, docker, MSA, Redux/Redux-saga, Sequilize, MariaDB, Jira, Teams",
                },
                {
                    title: "홈페이지, 쇼핑몰 제작 사이트(클릭엔) 유지보수 및 신규 기능 추가",
                    contents: "신규 기능 및 개선 작업, 유지보수 등",
                    stack: "Laravel, PHP, React, Jquery, Jira, MariaDB, Gitlab",
                },
            ],
        },
        {
            id: 2,
            name: "SK쉴더스",
            start: "2022-03-16",
            end: "2022-08-16",
            position: "보안솔루션운영팀 선임",
            job: [
                {
                    title: "고객사(SKBroadband)를 대상으로 보안 솔루션 운영 및 담당",
                    contents:
                        "유해사이트 차단(사내망 & 단독망), 메일 보안, 유해 파일 탐지 및 차단, 통합 로그 조회 및 관리, 망간 자료전송 솔루션 담당",
                    stack: "",
                },
            ],
        },
        {
            id: 3,
            name: "프로젝트제이지",
            start: "2021-02-01",
            end: "2021-12-31",
            position: "외주프로젝트 진행(사업자 등록)",
            job: [
                {
                    title: "웹사이트 프로토타입 프로젝트 PM 및 FE 개발, 유지보수",
                    contents: "프로토타입 버전 개발 성공 및 프로젝트 종료",
                    stack: "Django, Angular, Google Analytics, Github, Zoom",
                },
            ],
        },
    ],
    activity: [
        {
            id: 1,
            name: "제로베이스",
            start: "2022-08-01",
            end: "2023-01-31",
            introduce: "Frontend 개발의 기초부터 프로젝트 경험까지 한번에 배울 수 있는 교육",
            position: "수강생",
            takeaway:
                "HTML, CSS, Javascript의 기초를 다시 잡을 수 있고, Sass 및 SCSS나 Typescript에 대해서도 배울 수 있으며 React나 Vue를 통해 프로젝트를 진행하고 관련 피드백을 받을 수 있었습니다. 또한 주기적인 코딩테스트를 통해 알고리즘 소양을 기를 수 있었으며 특강을 통해 현업에서는 어떤 개발자를 원하는지, 어떤 개발자가 되어야하는지를 배울 수 있었습니다.",
            image: "zerobase",
        },
        {
            id: 2,
            name: "프로젝트제이지 창업",
            start: "2021-02-01",
            end: "2021-12-31",
            introduce: "법인회사와 단기간 계약을 맺어 1차 프로젝트로 할 데모 웹사이트 구축",
            position: "PM(Project Manager)",
            takeaway:
                "취업이나 입시를 위해 구글링을 하지 않고도 다양한 활동 및 동아리, 대회, 봉사 등들을 한번에 볼 수 있게 하여 취업준비생이나 입시준비생, 주부 등에게 도움을 주며 해당 활동을 완료한 사람에게도 자문을 구할 수 있는 웹사이트를 개발하였습니다. 처음으로 디자이너 및 백엔드, 프론트엔드 개발자 모두 모여 웹사이트를 구축했던 시간이라 보람찬 시간이였습니다. (계약상 결과물 제공 불가)",
            image: "wbs",
        },
        {
            id: 3,
            name: "K-Shield .Jr (케이쉴드주니어)",
            start: "2021-03-08",
            end: "2021-05-18",
            introduce: "사이버보안 실무인재 양성 과정 중 정보보호 관리진단 과정 수료",
            position: "수강생",
            takeaway:
                "모의 훈련 사이트를 통해 모의해킹을 수행하였으며 SQLi, 웹쉘 업로드 등 여러 해킹들을 성공적으로 수행하였고, 이를 문서로 정리해 모의 기업에 발표하는 프로젝트를 진행하였습니다. 기존에는 컨설팅이라는 업무는 자세하게 어떤 일을 하는지 잘 몰랐었는데 이번 기회를 통해 컨설팅을 어떤 식으로 접근해야하는지 또 어떤 솔루션을 내놓는 것이 바람직한지 고민할 수 있었던 시간이였던 것 같습니다.",
            image: "",
        },
        {
            id: 4,
            name: "(한이음)추계학술발표대회",
            start: "2020-11-06",
            end: "2020-11-07",
            introduce: "한이음과 연계하여 한국정보처리학회에서 주최하는 추계학술발표대회에 참가하여 논문 제출",
            position: "한이음 수료생",
            takeaway:
                "먼저 처음으로 논문을 작성하고 투고한 것이기 때문에 너무나도 큰 경험이 아닐 수 없었고 코로나19의 여파로 인해 원래는 현장에서 직접 발표하는 방식이였으나 사이트 내에서 다른 팀들의 논문 자료를 보는 방식으로 바뀌어 조금 아쉬운 점이 있었습니다. 하지만 그럼에도 정말 값진 경험이였고 오히려 논문을 작성하는 과정에서 수행하였던 프로젝트에 대해 더 심도있게 연구하고 구체적인 데이터들을 창출해내는 계기가 되었던 것 같습니다.",
            image: "",
        },
        {
            id: 4,
            name: "KISA 침해사고 대응 훈련",
            start: "2020-06-08",
            end: "2020-06-14",
            introduce: "KISA에서 제공하는 온라인 훈련장을 통해 일방향 침해사고 대응 훈련(중급)을 수행",
            position: "수강생",
            takeaway:
                "본 훈련은 APT침투, 악성코드 헌팅, 로그분석으로 나뉘어져 있고 각 과목 모두 수료기준을 통과하였습니다. 가장 큰 장점으로 온라인 가상환경을 통해 직접 공격 및 분석하는 것이 가능했기에 더 깊게 공부할 수 있어 의미있는 시간이지 않았나 생각했습니다.",
            image: "",
        },
    ],
    project: [
        {
            id: 1,
            name: "졸업 프로젝트",
            start: "2020-12-24",
            end: "2021-02-28",
            introduce: "딥러닝을 이용한 악성 문자열 필터링 어플리케이션 개발(PC, Mobile APP)",
            stack: "DeepLearning, Python, Chrome Extension, Java(Android), Swift(IOS), Javascript",
            takeaway:
                "어느날 문득 '언제까지 사람들이 악플에 시달리며 고통받아야할까'라는 생각이 들었고 최근 이슈되고 있는 인공지능 기술을 이용해서 악성 댓글을 포함한 모든 악의적인 문자열을 치환할 수 있을까라는 생각을 했습니다. 이 생각을 바로 실천에 옮겨 기존에 나와있는 악성 댓글을 필터링하는 네이버 \"클린봇\" 등은 해당 댓글에서만 기능을 발휘하지만 이보다 더 많이 필터링할 수 있는 것을 개발해보고 싶었습니다. 그래서 크롬 확장프로그램을 이용해서 서버와 통신하여 실시간으로 악성 문자열을 필터링 할 수 있는 프로그램을 만들었고, 크롤링 및 오픈 데이터로 인공지능에 학습할 약 9만 2천여개의 데이터셋을 직접 만들었습니다. 그럼에도 정확도는 비록 높진 않았지만 제가 의도한대로 프로그램은 악성 문자열을 잘 필터링하였고, 기사의 댓글뿐만 아니라 실시간 방송의 채팅까지도 필터링 할 수 있게 개발을 성공하였습니다. 혼자서 기획, 계획, 개발, 수정, 검토를 모두 진행하며 여태까지 개발 경험 중 제일 많이 배웠던 시간이였습니다.",
            image: "GP_1,GP_2,GP_3,GP_4,GP_5,GP_6,GP_7,GP_8",
        },
        {
            id: 2,
            name: "한이음 프로젝트",
            start: "2020-05-01",
            end: "2020-11-30",
            introduce: "디바이스 드라이버를 통한 랩톱 보안 소프트웨어 개발",
            stack: "Python, PyQt5, Java(Android), OpenCV, C(Win Driver)",
            takeaway:
                '더 편하게, 더 안전하게 공공장소에서도 노트북의 보안을 강화할 수 없을까?라는 주제로 약 6개월간 ICT기업전문가(멘토)님과 팀을 이루어 프로젝트를 수행함으로써 실무 역량을 향상시켰습니다. 수행한 프로젝트명은 "디바이스 드라이버를 활용한 랩톱 보안 소프트웨어"로 얼굴인식을 활용하여 노트북의 잠금을 디바이스 드라이버단에서 차단할 수 있게하는 프로그램 개발 프로젝트였습니다. 당시 파이썬을 이용한 메인 프로그램 제작과 자바 언어를 이용한 모바일 어플리케이션 개발도 같이 하였습니다. 모바일 앱 같은 경우 현재 코로나 시국으로 인해 얼굴인식이 원활하지 않아 그 단점을 해결하고자 블루투스를 연동시킨 모바일로 잠금해제하기 위해 개발하였습니다. 따라서 얼굴인식을 통한 잠금해제 말고도 모바일을 통해 텍스트 전송 혹은 음성 인식을 통해 노트북의 잠금을 해제할 수 있었습니다. 개발 결과 메인 프로그램과 모바일 앱 모두 완성시켰으나 윈도우 드라이버 개발에서 어려움을 겪어 약 90%정도 완성시키고 마무리하였습니다. 비록 완성품을 만들어내진 못했지만 생각보다 높은 완성률을 이뤄냈다는 것과 팀원과의 프로젝트는 어떤식으로 분담하여 진행하는지, 어떤 식으로 협업하는지 등을 멘토님을 통해 배울 수 있어서 좋았던 시간이였습니다.',
            image: "HA_1,HA_2,HA_3,HA_4",
        },
        {
            id: 3,
            name: "스케줄 매니저",
            start: "2022-07-17",
            end: "2022-09-30",
            introduce: "단순 반복 문서 작업을 위해 자동으로 반복 생성되는 웹사이트 개발",
            stack: "Vue, Node.js, MySQL, Bootstrap, Github, Heroku",
            takeaway:
                "팀원끼리 일정을 공유하면서 주기적으로 보고해야하는 문서, 결재 받아야하는 문서 등을 자동으로 생성해주는 웹사이트를 개발하고자 했습니다. 일정을 추가하면 해당 첨부파일이 주기적으로 자동 생성이 되고, 해당 날짜에 맞게 내용도 바뀌게끔 설계하려 하였으나 개발 도중 해당 아이디어가 웹사이트로 이용했을 시 편의성, 보안성, 규모 등을 고려했을 때 웹사이트가 아닌 응용SW로 개발하는 것이 더 효율적일 것 같다는 생각을 하여 미완성으로 마무리하였습니다. 하지만 구축한 코드에는 로그인과 일정 업로드, 수정, 삭제 기능을 구현해놓았으며 풀스택 기초 설계 부분에서 학습한 경험이였던 것 같습니다. 개발하면서 초기 디자인과 설계의 중요성을 매우 느꼈으며 특히 반복되는 문서의 복사의 경우 문서를 파싱하여 해당 날짜에 맞게 문서를 재작성하고 다시 업로드를 해야하는데 혼자서 안정적으로 개발하기엔 한계를 느껴 팀원이 이만큼 중요하구나 하는 생각도 하였습니다.",
            image: "SC_1,SC_2,SC_3,SC_4,SC_5,SC_6,SC_7,SC_8",
        },
        {
            id: 4,
            name: "포트폴리오 (feat. Gatsby)",
            start: "2021-07-18",
            end: "2021-11-21",
            introduce: "React 프레임워크(Gatsby)를 이용한 정적 포트폴리오 사이트",
            stack: "React, Gatsby, Node.js, Typescript, SCSS, Github",
            takeaway:
                "React의 정적 페이지 학습을 위해 Gatsby를 이용하여 포트폴리오 사이트를 한번 구현해보았습니다. 정적 페이지라 백엔드나 DB와 연결하지 않으며 동적으로 스크립트를 통해 웹페이지는 변경하지 않아 구현하는데 있어 Section 단위로 관리해주면 돼서 규모자체는 굉장히 간단하였습니다. 다만 Adblock 프로그램의 영향이 조금 있었고, 포트폴리오 페이지이기 때문에 추가하고자 하는 요소가 발생하면 포트폴리오 내용을 하나로 모은 파일인 mock.js 파일을 결국 수정해야한다는 부분이 조금 불편한 점이였던 것 같습니다. 이 부분을 보완하고자 다음에 포트폴리오 사이트를 만약 만들게 된다면 백엔드 및 DB와도 연동시키고 자동으로 레이아웃을 생성하는 스크립트를 구현하여 포트폴리오 수정, 추가, 삭제 시 페이지에서 수정할 수 있는 페이지도 한번 만들어봐야겠다하는 다짐을 했습니다. 정적인 페이지는 규모가 워낙 간단하다는 매력이 있긴 하지만 더 깊고 디테일한 페이지 제작을 위해선 동적 웹페이지로 구현하는게 더 많은 case를 고려할 수 있겠구나 생각하였습니다.",
            image: "GA_1,GA_2,GA_3,GA_4,GA_5,GA_6,GA_7,GA_8",
        },
        {
            id: 5,
            name: "포트폴리오 ver.2 (feat. Next.js)",
            start: "2022-10-01",
            end: "2022-11-31",
            introduce: "React 프레임워크(Next.js)를 이용한 SEO 최적화 포트폴리오 사이트",
            stack: "React, Next.js, ExpressJS, Mysql, SCSS, Typescript, HTML5, Github, Heroku, Vercel",
            takeaway:
                "Next.js의 경우 SEO를 위한 프레임워크이기 때문에 채용시장에서 많이 사용할 것 같아 써보니 어렵지도 않았고 재미있었습니다. 특히 Next.js에서는 폴더이름이나 파일이름을 기준으로 개발해야하기 때문에 혼자 개발해도 디렉토리 구조가 깔끔해져서 좋았습니다. 욕심을 조금 더 내서 Animation도 넣어봤는데 성능 부분에서도 최적화를 챙길 수 있도록 이 부분에 대한 학습 필요를 느꼈습니다.",
            image: "",
        },
        {
            id: 6,
            name: "키오스크를 대신하는 플랫폼, 핑거오더",
            start: "2022-11-01",
            end: "2022-12-31",
            introduce: "가게 사장님이 직접 회원가입하고 가게를 등록하는 페이지 개발",
            stack: "React, Next.js, SCSS, Typescript, Recoil, Slack, Discord, Github",
            takeaway:
                "가장 많이 배운 건 이 프로젝트가 처음 진행한 협업 프로젝트였기 때문에 협업하는 법을 가장 많이 배울 수 있었습니다. 또 새로운 기술인 Recoil과 SCSS를 적용해보며 기술 적용에 있어 스스로 성장하는 느낌을 받았습니다. 같이 개발하는 개발자와 코드 컨벤션을 맞추며 작업하는 것의 필요성을 느끼고 적용하였으며 React.js에서도 아직 배워야 할 기술들이 많다는 것을 알고 추후 프로젝트에서는 적용해봐야겠다 생각하는 시간을 가졌습니다.",
            image: "",
        },
    ],
};
